{
    "fullName": "Giang Nguyen Huong",
    "avatar": "",
    "career": "Full-stack PHP Developer",
    "birthDate": "03/04/1996",
    "gender": "Female",
    "phone": "(+84) 0912800616",
    "mail": "nguyengiangsc96@gmail.com",
    "address": "Hanoi, Vietnam",
    "github": "",
    "linkedin": "https://www.linkedin.com/in/giang-nguyen-533a7515b/",
    "about": "Full-stack PHP Developer with over 5 years of experience in developing web systems using Laravel, combined with front-end development using Vue.js and AngularJS. Proficient in business analysis, system design, and delivering effective technical solutions. Capable of independently proposing technical ideas, performing system analysis and design, and implementing full backend/frontend development for new projects.",
    "skills": {
        "Language": "PHP, Javascript",
        "Frameworks": "Laravel, VueJS/NuxtJS, AngularJS",
        "Databases": "MySQL, MongoDB",
        "Dev tools": "WSL, Git, Composer, NPM, Jetbrains IDE, ..."
    },
    "edu": [
        {
            "school": "Posts and Telecommunications Institute of Technology",
            "spec": "Information Technology",
            "startDtMo": null,
            "startDtYr": 2014,
            "endDtMo": null,
            "endDtYr": 2019,
            "degree": "Bachelor of Computer Science"
        }
    ],
    "exp": [
        {
            "company": "MIRAI VIETNAM SOFTWARE JSC",
            "empType": "Full-time",
            "title": "Software Developer",
            "startDtMo": 11,
            "startDtYr": 2019,
            "endDtMo": null,
            "endDtYr": null,
            "location": "Hanoi, Vietnam"
        }
    ],
    "projects": [
        {
            "name": "Shachihata Cloud",
            "startDtMo": 6,
            "startDtYr": 2020,
            "endDtMo": null,
            "endDtYr": null,
            "role": "Full-stack Developer, Module Lead",
            "roleDes": [
                "Developed and maintained core modules including digital signature workflows, document management, and approval processes.",
                "Designed architecture for key modules to ensure scalability and high performance.",
                "Mentored team members, conducted code reviews, and coordinated with cross-functional teams to deliver high-quality features on time."
            ],
            "des": "Electronic Document Signing and Management System – SaaS Platform for Enterprises. Contributed to the development of a large-scale system focused on electronic document signing. The platform allows users to upload documents, digitally sign them, and send for approval. It supports long-term document storage, full-text search, and follows strict security standards. The system also includes HRM features such as employee management, attendance tracking, leave request/approval, and work scheduling. Designed as a multi-tenant SaaS solution, the system serves multiple independent organizations.",
            "market": "Japan",
            "tech": [
                "Laravel",
                "VueJS/NuxtJS",
                "AngularJS",
                "React Native",
                "Java",
                "MySQL",
                "MongoDB",
                "RabbitMQ",
                "Supervisor"
            ],
            "team": "34 - 50 members"
        },
        {
            "name": "Ebi iot",
            "startDtMo": 11,
            "startDtYr": 2019,
            "endDtMo": 5,
            "endDtYr": 2020,
            "role": "Full-stack Developer",
            "roleDes": [
                "Responsible for developing and managing the backend system that collects, stores, and processes sensor data (e.g., temperature, pH, dissolved oxygen) from IoT devices.",
                "Built features for real-time data analytics, statistical reporting, and visual dashboards to help users monitor fish farming conditions and make timely decisions."
            ],
            "des": "Build new and maintain a smart Fish Foaming System using IoT sensors and automated controls. Enabled remote monitoring, early warnings, and improved farming efficiency.",
            "market": "Japan",
            "tech": [
                "Laravel",
                "VueJS",
                "MySQL"
            ],
            "team": "6 members"
        }
    ]
}
